src/InformationRegisters/НастройкиИнтеграцииSlack.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииSlack</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрока20</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНастроекИнтеграцииSlack</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыНастроекИнтеграцииSlack.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНастроекИнтеграцииSlack</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПользовательId</Name>
					<Comment>Идентификатор пользователя в Slack</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольноеЧисло</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ИнтеграцияSlackСлужебный/Ext/Module.bsl
#Область ПрограммныйИнтерфейс_User

Функция ЭтоКоманда_User(знач ИмяКоманды) Экспорт 
	Возврат (ИмяКоманды = "/user");
КонецФункции

Функция ВыполнитьКоманду_User(знач ИмяКоманды, знач ДанныеКоманды) Экспорт
	ТекстКоманды = ДанныеКоманды.text;
	
	Если ТекстКоманды = "help" Тогда
		Ответ = ВыполнитьКоманду_User_Help(ДанныеКоманды);
	ИначеЕсли СтрНачинаетсяС(ТекстКоманды, "checkin") Тогда
		Ответ = ВыполнитьКоманду_User_CheckInOut(ДанныеКоманды);
	ИначеЕсли СтрНачинаетсяС(ТекстКоманды, "checkout") Тогда
		Ответ = ВыполнитьКоманду_User_CheckInOut(ДанныеКоманды);
	Иначе 
		Ответ = Неопределено;
	КонецЕсли;	
	
	Если ТипЗнч(Ответ) = Тип("HTTPСервисОтвет") Тогда
		Возврат Ответ;
	Иначе
		ТекстОшибки		= НСтр("ru='команда не определена'");
		ТекстПодсказки	= СтрШаблон(НСтр("ru='Используйте подсказку `/user help`.'"), ИмяКоманды);
		Возврат ИнтеграцияSlack.ОтветОшибка(ТекстОшибки, ТекстПодсказки);
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_User

Функция ВыполнитьКоманду_User_Help(знач СтруктураКоманды)
	ТекстОтвета = НСтр("ru=':wave: Привет! Я помощник для Slack. Для взаимодействия со мной'")
		+ НСтр("ru=' введи одну из этих команд в окне сообщения:'");
		
	ТекстКоманды = 
		СтрШаблон("`/user checkin <КонтрольноеЧисло>`: %1", НСтр("ru='создание связи с пользователем 1С'"));
		
	СтруктураКоманды = Новый Структура;
	СтруктураКоманды.Вставить("color"	, ВРег(ОбщегоНазначенияПТБКлиентСервер.ЦветВHex(255, 69, 0)));
	СтруктураКоманды.Вставить("text"	, ТекстКоманды);
	
	МассивКоманды = Новый Массив;
	МассивКоманды.Добавить(СтруктураКоманды);
	
	Структура = Новый Структура;
	Структура.Вставить("text"		, ТекстОтвета); 
	Структура.Вставить("attachments", МассивКоманды);
	
	Возврат ИнтернетСервисы.ПолучитьОтвет200(, ИнтернетСервисы.ПолучитьСтрокуJSON(Структура),,);
КонецФункции

Функция ВыполнитьКоманду_User_CheckInOut(знач СтруктураКоманды)
	МассивПараметров = СтрРазделить(СтруктураКоманды.text, "+", Ложь);
	Если МассивПараметров.Количество() < 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВидКоманды			= МассивПараметров[0];
	КонтрольноеЧисло	= МассивПараметров[1];
	
	ИдентификаторПользователя	= СтруктураКоманды.user_id;
	ПользовательСсылка			= РегистрыСведений.НастройкиИнтеграцииSlack.ПолучитьПользователяПоКонтрольномуЧислу(КонтрольноеЧисло);
	НастройкаСсылка				= Перечисления.ВидыНастроекИнтеграцииSlack.ПользовательId;
	
	Если НЕ ЗначениеЗаполнено(ПользовательСсылка) Тогда
		Возврат ИнтеграцияSlack.ОтветОшибка(НСтр("ru='пользователь не найден'"), НСтр("ru='Проверьте контрольное число.'"));
	КонецЕсли;
	
	Если ВидКоманды = "checkin" Тогда
		РегистрыСведений.НастройкиИнтеграцииSlack.УстановитьЗначениеНастройки(ПользовательСсылка, НастройкаСсылка, ИдентификаторПользователя);
		РезультатВыполнения = СтрШаблон(НСтр("ru='Пользователь связан с `%1`.'"), СокрЛП(ПользовательСсылка));
	ИначеЕсли ВидКоманды = "checkout" Тогда
		РегистрыСведений.НастройкиИнтеграцииSlack.УстановитьЗначениеНастройки(ПользовательСсылка, НастройкаСсылка, "");
		РезультатВыполнения = СтрШаблон(НСтр("ru='Связь с пользователем `%1` разорвана.'"), СокрЛП(ПользовательСсылка));
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("text", НСтр("ru=':ok_hand: Команда выполнена. '") + РезультатВыполнения); 
	
	Возврат ИнтернетСервисы.ПолучитьОтвет200(, ИнтернетСервисы.ПолучитьСтрокуJSON(Структура),,);
КонецФункции

#КонецОбласти
